/<[hH][123][^>]*>/ {
    # εκτέλεσε αυτήν την πράξη αν η γραμμή περιέχει ετικέτα ανοίγματος
    do {
        open_tag = match($0, /<[hH][123][^>]*>/)
        $0 = substr($0, open_tag)       # σβήσε το κείμενο πριν από αυτήν
                                        # $0 είναι η τρέχουσα γραμμή εισόδου
        while (!/<\/[hH][123]>/) {      # τύπωσε τις εσωτερικές γραμμές
            print                       #    ολόκληρες
            if (getline != 1) exit
        }
        close_tag = match($0, /<\/[hH][123]>/) + 4

        print substr($0, 0, close_tag)  # τύπωσε μέχρι το κλείσιμο
        $0 = substr($0, close_tag + 1)  # σβήσε μέχρι το κλείσιμο
    } while (/<[hH][123]>/)             # επανάλαβε όσο υπάρχει άνοιγμα
}
